Autodesk.Revit.DB.BuiltInFailures.DPartFailures.SourceInUnloadedLink
Some elements already have parts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingUndividedDPartParents
These parts are not intersected by any dividing references. They will be removed from the division.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingInvalidDPartParents
Can't make Parts out of these Elements.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartsCannotBeCreatedFromInvalidGeom
Post failure when attempts to create parts from invalid geometry.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartPhaseParametersConflictWithOriginal
The creation and demolition phases of a part must lie between the corresponding phases of the original.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.NoPartMakerCreatedInEditMode
Nothing will be divided.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.IneligibleElementsForParts
Creating parts from ineligible elements

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.ElementsAlreadyHaveParts
Some elements already have parts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoReferences
The division contains no dividing references.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoParts
The division contains no parts.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves
Sketch contains curves to which profiles cannot be applied or chains of curves.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesNonSlabSources
Some sources of a volume divider are non-slab like.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthSome
Division family cannot be used with the selected division gap for some widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthAll
Division family cannot be used with the selected division gap for all widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthSome
Division family cannot be used for some widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthAll
Division family cannot be used for all widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome
Division family cannot be used with the selected edge condition for some widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthAll
Division family cannot be used with the selected edge condition for all widths of hosts

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingOriginalWillDeleteParts
Deletion of this element will delete its associated Parts.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteMorePartsError
Deleting a Part will delete all associated Parts and the original Element will be made visible.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteAllPartsWarning
Deleting a Part will delete all associated Parts and the original Element will be made visible.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures.BindLinkWillDeleteAllPartsWarning
Bind Link will delete its associated Parts.

Autodesk.Revit.DB.BuiltInFailures.DPartFailures
Failures related to parts.